-- SELECT * from pbi.v_Statement
-- SELECT * from pbi.vb_Statement

-- SELECT * from pbi.v_Statement where IdleEnd >= CAST(GETDATE() AS DATE)

-- SELECT * from pbi.v_StatementType
-- SELECT * from pbi.vb_StatementType

IF EXISTS(SELECT v.name FROM sys.views v
				INNER JOIN sys.schemas s ON v.schema_id = s.schema_id
			WHERE v.name = 'v_Statement' AND v.type = 'V' AND s.name = 'pbi')
    DROP VIEW pbi.v_Statement
GO

Create view pbi.v_Statement AS

SELECT 
	CONVERT(VARCHAR(MAX), ST._IDRRef, 2) AS IdleRef,
	ST._Number AS Number,
	IIF(ST._Date_Time >= DATEFROMPARTS(4001,1,1), DATEADD(YEAR, -2000, ST._Date_Time), ST._Date_Time) AS IdleDate,
	CONVERT(VARCHAR(MAX), ST._Fld26884RRef, 2) as CompanyRef,
	CONVERT(VARCHAR(MAX), ST._Fld26887_RRRef, 2) AS TruckRef,
	CONVERT(VARCHAR(MAX), ST._Fld26888_RRRef, 2) as TrailerRef,
	CAST(IIF(ST._Fld26889 >= DATEFROMPARTS(4001,1,1), DATEADD(YEAR, -2000, ST._Fld26889), ST._Fld26889) AS DATE) AS IdleStart,
	ST._Fld26889 AS 'IdleStartRaw',
	CAST(IIF(ST._Fld26890 >= DATEFROMPARTS(4001,1,1), DATEADD(YEAR, -2000, ST._Fld26890), ST._Fld26890) AS DATE) AS IdleEnd,
	CONVERT(VARCHAR(MAX), ST._Fld26892RRef, 2) AS StatusRef,
	CAST(_Fld34581 AS bit) AS Risk 

FROM _Document26883 ST

WHERE _Marked = 0
--order by ST._Fld26890

GO


IF EXISTS(SELECT v.name FROM sys.views v
				INNER JOIN sys.schemas s ON v.schema_id = s.schema_id
			WHERE v.name = 'v_StatementType' AND v.type = 'V' AND s.name = 'pbi')
    DROP VIEW pbi.v_StatementType
GO

Create view pbi.v_StatementType AS

SELECT 
	CONVERT(VARCHAR(MAX), _Reference308._IDRRef, 2) AS 'StatementTypeRef',
	_Reference308._Description AS 'Status',
	CASE _Reference308._Description
        WHEN N'Виконання рейсу' THEN N'Робота'
        WHEN N'Подача автомобіля (оплачуваний)' THEN N'Робота'
        WHEN N'Відпустка' THEN N'Простій'
        WHEN N'Відстій (неоплачуваний)' THEN N'Робота'
        WHEN N'Відстій (оплачуваний)' THEN N'Робота'
        WHEN N'Переоформлення документів (неоплачуваний)' THEN N'Простій'
        WHEN N'Переоформлення документів (оплачуваний)' THEN N'Простій'
        WHEN N'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN N'Простій'
        WHEN N'Простій АТЗ (відп. Експлуатація( оплачуваний))' THEN N'Простій'
        WHEN N'Простій на завантаженні (відп. Експлуатація)' THEN N'Робота'
        WHEN N'Простій на замитненні (відп. Екслуатація)' THEN N'Робота'
        WHEN N'Простій на розвантаженні (відп. Експлуатація)' THEN N'Робота'
        WHEN N'Авто на продаж' THEN N'Простій'
        WHEN N'Армія' THEN N'Простій'
        WHEN N'Простій на кордоні (форс-мажор)' THEN N'Робота'
        WHEN N'Розвантаження (Технологічний простій)' THEN N'Робота'
        WHEN N'Святкові / Вихідні (неоплачуваний)' THEN N'Простій'
        WHEN N'Форс-мажор' THEN N'Робота'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Робота'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Робота'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Простій'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Простій'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Робота'
        WHEN N'Очікування ремонту (неоплачуваний)' THEN N'Простій'
        WHEN N'Очікування ремонту (оплачуваний)' THEN N'Простій'
        WHEN N'Поломка в дорозі (оплачуваний)' THEN N'Робота'
        WHEN N'Ремонт (неоплачуваний)' THEN N'Простій'
        WHEN N'Ремонт (оплачуваний)' THEN N'Простій'
        WHEN N'Ремонт (сервіс)' THEN N'Простій'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Робота'
        ELSE N'Невідомо'
    END AS StatementType1, -- робота або простій
	
	CASE _Reference308._Description
        WHEN 'Виконання рейсу' THEN 'Виконання рейсу'
        WHEN 'Подача автомобіля (оплачуваний)' THEN 'Комерційний'
        WHEN 'Відпустка' THEN 'Експлуатація'
        WHEN 'Відстій (неоплачуваний)' THEN 'Експлуатація'
        WHEN 'Відстій (оплачуваний)' THEN 'Експлуатація'
        WHEN 'Переоформлення документів (неоплачуваний)' THEN 'Експлуатація'
        WHEN 'Переоформлення документів (оплачуваний)' THEN 'Експлуатація'
        WHEN 'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN 'Експлуатація'
        WHEN 'Простій АТЗ (відп. Експлуатація( оплачуваний))' THEN 'Експлуатація'
        WHEN 'Простій на завантаженні (відп. Експлуатація)' THEN 'Експлуатація'
        WHEN N'Простій на замитненні (відп. Екслуатація)' THEN 'Експлуатація'
        WHEN N'Простій на розвантаженні (відп. Експлуатація)' THEN 'Експлуатація'
        WHEN N'Авто на продаж' THEN 'Інше'
        WHEN N'Армія' THEN 'Інше'
        WHEN N'Простій на кордоні (форс-мажор)' THEN 'Інше'
        WHEN N'Розвантаження (Технологічний простій)' THEN N'Інше'
        WHEN N'Святкові / Вихідні (неоплачуваний)' THEN N'Інше'
        WHEN N'Форс-мажор' THEN N'Інше'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Комерційний'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Комерційний'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Комерційний'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Комерційний'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Очікування ремонту (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Очікування ремонту (оплачуваний)' THEN N'Ремонт'
        WHEN N'Поломка в дорозі (оплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (оплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (сервіс)' THEN N'Ремонт'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Комерційний'
        ELSE N'Невідомо'
    END AS StatementType2, -- відповідальний відділ

	CASE _Reference308._Description
        WHEN N'Подача автомобіля (оплачуваний)' THEN N'Не в рейсі'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Не в рейсі'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Не в рейсі'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Не в рейсі'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Не в рейсі'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Завантаження'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Замитнення'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Кордон'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Розвантаження'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Розмитнення'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Завантаження'
        ELSE N'Інше'
    END AS StatementType3, -- деталізація комерційних простоїв

	CASE _Reference308._Description
        WHEN 'Відстій (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Переоформлення документів (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN 'Без оплати'
        WHEN 'Святкові / Вихідні (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Очікування завантаження (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Простій без роботи (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Очікування ремонту (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Ремонт (неоплачуваний)' THEN 'Без оплати'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN 'Без оплати'
        ELSE 'Оплачено'
    END AS StatementType4, -- оплата праці водію

    CASE _Reference308._Description
        WHEN N'Виконання рейсу' THEN N'Виконання рейсу'
        WHEN N'Подача автомобіля (оплачуваний)' THEN N'Подача'
        WHEN N'Відпустка' THEN N'Відстій'
        WHEN N'Відстій (неоплачуваний)' THEN N'Відстій'
        WHEN N'Відстій (оплачуваний)' THEN N'Відстій'
        WHEN N'Переоформлення документів (неоплачуваний)' THEN N'Простій без водія'
        WHEN N'Переоформлення документів (оплачуваний)' THEN N'Простій без водія'
        WHEN N'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN N'Простій без водія'
        WHEN N'Простій АТЗ (відп. Експлуатація( оплачуваний))' THEN N'Простій без водія'
        WHEN N'Простій на завантаженні (відп. Експлуатація)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на замитненні (відп. Екслуатація)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на розвантаженні (відп. Експлуатація)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Авто на продаж' THEN N'Інше'
        WHEN N'Армія' THEN N'Інше'
        WHEN N'Простій на кордоні (форс-мажор)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Розвантаження (Технологічний простій)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Святкові / Вихідні (неоплачуваний)' THEN N'Відстій'
        WHEN N'Форс-мажор' THEN N'Інше'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Очікування завантаження'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Очікування завантаження'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Без роботи (неоплачуваний)'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Без роботи (оплачуваний)'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Очікування ремонту (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Очікування ремонту (оплачуваний)' THEN N'Ремонт'
        WHEN N'Поломка в дорозі (оплачуваний)' THEN N'Поломка в дорозі'
        WHEN N'Ремонт (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (оплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (сервіс)' THEN N'Ремонт'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Простій завантаження/розвантаження/митниця'
        ELSE N'Невідомо'
    END AS StatementType5 -- для щоденного звіту

FROM _Reference308

GO




IF EXISTS(SELECT v.name FROM sys.views v
				INNER JOIN sys.schemas s ON v.schema_id = s.schema_id
			WHERE v.name = 'vb_Statement' AND v.type = 'V' AND s.name = 'pbi')
    DROP VIEW pbi.vb_Statement
GO

Create view pbi.vb_Statement AS

SELECT 
	ST._IDRRef AS IdleRef,
	ST._Number AS Number,
	IIF(ST._Date_Time >= DATEFROMPARTS(4001,1,1), DATEADD(YEAR, -2000, ST._Date_Time), ST._Date_Time) AS IdleDate,
	ST._Fld26884RRef as CompanyRef,
	ST._Fld26887_RRRef AS TruckRef,
	ST._Fld26888_RRRef as TrailerRef,
	CAST(IIF(ST._Fld26889 >= DATEFROMPARTS(4001,1,1), DATEADD(YEAR, -2000, ST._Fld26889), ST._Fld26889) AS DATE) AS IdleStart,
	ST._Fld26889 AS 'IdleStartRaw',
	CAST(IIF(ST._Fld26890 >= DATEFROMPARTS(4001,1,1), DATEADD(YEAR, -2000, ST._Fld26890), ST._Fld26890) AS DATE) AS IdleEnd,
	ST._Fld26892RRef AS StatusRef,
	CAST(_Fld34581 AS bit) AS Risk 

FROM _Document26883 ST

WHERE _Marked = 0
--order by ST._Fld26890

GO


IF EXISTS(SELECT v.name FROM sys.views v
				INNER JOIN sys.schemas s ON v.schema_id = s.schema_id
			WHERE v.name = 'vb_StatementType' AND v.type = 'V' AND s.name = 'pbi')
    DROP VIEW pbi.vb_StatementType
GO

Create view pbi.vb_StatementType AS

SELECT 
	_Reference308._IDRRef AS 'StatementTypeRef',
	_Reference308._Description AS 'Status',
	CASE _Reference308._Description
        WHEN N'Виконання рейсу' THEN N'Робота'
        WHEN N'Подача автомобіля (оплачуваний)' THEN N'Робота'
        WHEN N'Відпустка' THEN N'Простій'
        WHEN N'Відстій (неоплачуваний)' THEN N'Робота'
        WHEN N'Відстій (оплачуваний)' THEN N'Робота'
        WHEN N'Переоформлення документів (неоплачуваний)' THEN N'Простій'
        WHEN N'Переоформлення документів (оплачуваний)' THEN N'Простій'
        WHEN N'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN N'Простій'
        WHEN N'Простій АТЗ (відп. Експлуатація( оплачуваний))' THEN N'Простій'
        WHEN N'Простій на завантаженні (відп. Експлуатація)' THEN N'Робота'
        WHEN N'Простій на замитненні (відп. Екслуатація)' THEN N'Робота'
        WHEN N'Простій на розвантаженні (відп. Експлуатація)' THEN N'Робота'
        WHEN N'Авто на продаж' THEN N'Простій'
        WHEN N'Армія' THEN N'Простій'
        WHEN N'Простій на кордоні (форс-мажор)' THEN N'Робота'
        WHEN N'Розвантаження (Технологічний простій)' THEN N'Робота'
        WHEN N'Святкові / Вихідні (неоплачуваний)' THEN N'Простій'
        WHEN N'Форс-мажор' THEN N'Робота'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Робота'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Робота'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Простій'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Простій'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Робота'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Робота'
        WHEN N'Очікування ремонту (неоплачуваний)' THEN N'Простій'
        WHEN N'Очікування ремонту (оплачуваний)' THEN N'Простій'
        WHEN N'Поломка в дорозі (оплачуваний)' THEN N'Робота'
        WHEN N'Ремонт (неоплачуваний)' THEN N'Простій'
        WHEN N'Ремонт (оплачуваний)' THEN N'Простій'
        WHEN N'Ремонт (сервіс)' THEN N'Простій'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Робота'
        ELSE N'Невідомо'
    END AS StatementType1, -- робота або простій
	
	CASE _Reference308._Description
        WHEN 'Виконання рейсу' THEN 'Виконання рейсу'
        WHEN 'Подача автомобіля (оплачуваний)' THEN 'Комерційний'
        WHEN 'Відпустка' THEN 'Експлуатація'
        WHEN 'Відстій (неоплачуваний)' THEN 'Експлуатація'
        WHEN 'Відстій (оплачуваний)' THEN 'Експлуатація'
        WHEN 'Переоформлення документів (неоплачуваний)' THEN 'Експлуатація'
        WHEN 'Переоформлення документів (оплачуваний)' THEN 'Експлуатація'
        WHEN 'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN 'Експлуатація'
        WHEN 'Простій АТЗ (відп. Експлуатація( оплачуваний))' THEN 'Експлуатація'
        WHEN 'Простій на завантаженні (відп. Експлуатація)' THEN 'Експлуатація'
        WHEN N'Простій на замитненні (відп. Екслуатація)' THEN 'Експлуатація'
        WHEN N'Простій на розвантаженні (відп. Експлуатація)' THEN 'Експлуатація'
        WHEN N'Авто на продаж' THEN 'Інше'
        WHEN N'Армія' THEN 'Інше'
        WHEN N'Простій на кордоні (форс-мажор)' THEN 'Інше'
        WHEN N'Розвантаження (Технологічний простій)' THEN N'Інше'
        WHEN N'Святкові / Вихідні (неоплачуваний)' THEN N'Інше'
        WHEN N'Форс-мажор' THEN N'Інше'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Комерційний'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Комерційний'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Комерційний'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Комерційний'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Комерційний'
        WHEN N'Очікування ремонту (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Очікування ремонту (оплачуваний)' THEN N'Ремонт'
        WHEN N'Поломка в дорозі (оплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (оплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (сервіс)' THEN N'Ремонт'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Комерційний'
        ELSE N'Невідомо'
    END AS StatementType2, -- відповідальний відділ

	CASE _Reference308._Description
        WHEN N'Подача автомобіля (оплачуваний)' THEN N'Не в рейсі'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Не в рейсі'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Не в рейсі'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Не в рейсі'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Не в рейсі'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Завантаження'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Замитнення'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Кордон'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Розвантаження'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Розмитнення'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Завантаження'
        ELSE N'Інше'
    END AS StatementType3, -- деталізація комерційних простоїв

	CASE _Reference308._Description
        WHEN 'Відстій (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Переоформлення документів (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN 'Без оплати'
        WHEN 'Святкові / Вихідні (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Очікування завантаження (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Простій без роботи (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Очікування ремонту (неоплачуваний)' THEN 'Без оплати'
        WHEN 'Ремонт (неоплачуваний)' THEN 'Без оплати'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN 'Без оплати'
        ELSE 'Оплачено'
    END AS StatementType4, -- оплата праці водію

    CASE _Reference308._Description
        WHEN N'Виконання рейсу' THEN N'Виконання рейсу'
        WHEN N'Подача автомобіля (оплачуваний)' THEN N'Подача'
        WHEN N'Відпустка' THEN N'Відстій'
        WHEN N'Відстій (неоплачуваний)' THEN N'Відстій'
        WHEN N'Відстій (оплачуваний)' THEN N'Відстій'
        WHEN N'Переоформлення документів (неоплачуваний)' THEN N'Простій без водія'
        WHEN N'Переоформлення документів (оплачуваний)' THEN N'Простій без водія'
        WHEN N'Простій АТЗ (відп. Експлуатація( неоплачуваний))' THEN N'Простій без водія'
        WHEN N'Простій АТЗ (відп. Експлуатація( оплачуваний))' THEN N'Простій без водія'
        WHEN N'Простій на завантаженні (відп. Експлуатація)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на замитненні (відп. Екслуатація)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на розвантаженні (відп. Експлуатація)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Авто на продаж' THEN N'Інше'
        WHEN N'Армія' THEN N'Інше'
        WHEN N'Простій на кордоні (форс-мажор)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Розвантаження (Технологічний простій)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Святкові / Вихідні (неоплачуваний)' THEN N'Відстій'
        WHEN N'Форс-мажор' THEN N'Інше'
        WHEN N'Очікування завантаження (неоплачуваний)' THEN N'Очікування завантаження'
        WHEN N'Очікування завантаження (оплачуваний)' THEN N'Очікування завантаження'
        WHEN N'Простій без роботи (неоплачуваний)' THEN N'Без роботи (неоплачуваний)'
        WHEN N'Простій без роботи (оплачуваний)' THEN N'Без роботи (оплачуваний)'
        WHEN N'Простій на завантаженні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на замитненні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на кордоні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на розвантаженні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Простій на розмитненні (відп. Замовник)' THEN N'Простій завантаження/розвантаження/митниця'
        WHEN N'Очікування ремонту (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Очікування ремонту (оплачуваний)' THEN N'Ремонт'
        WHEN N'Поломка в дорозі (оплачуваний)' THEN N'Поломка в дорозі'
        WHEN N'Ремонт (неоплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (оплачуваний)' THEN N'Ремонт'
        WHEN N'Ремонт (сервіс)' THEN N'Ремонт'
		WHEN N'Простій (відп. Замовник - неоплачуваний)' THEN N'Простій завантаження/розвантаження/митниця'
        ELSE N'Невідомо'
    END AS StatementType5 -- для щоденного звіту

FROM _Reference308

GO